[{"index":"0001","genrese":"Adventure","name":"Pirates of the Caribbean 1","directed":"Gore Verbinski","runtime":"144","year":"2003","language":"English","moreinformation":"Pirates of the Caribbean: The Curse of the Black Pearl (2003) Blacksmith Will Turner teams up with eccentric pirate Captain Jack Sparrow to save Turner's love, Elizabeth Swann, from cursed pirates led by Jack's mutinous former first mate, Hector Barbossa. Jack wants revenge against Barbossa, who left him stranded on an island before stealing his ship, the Black Pearl, along with 882 pieces of cursed Aztec Gold.","image":"0001.jpg"},{"index":"0002","genrese":"Adventure","name":"Pirates of the Caribbean : Dead Man's Chest ","directed":"Gore Verbinski","runtime":"151","year":"2006","language":"English","moreinformation":"Lord Cutler Beckett of the East India Trading Company arrests Will and Elizabeth for aiding Captain Jack Sparrow in the previous film. Beckett offers clemency if Will agrees to search for Jack's compass in a bid to find the Dead Man's Chest—and inside, the heart of villainous Davy Jones—which would give Beckett control of the seas. However, Jack wants the Chest to escape from an unpaid debt with Jones, who made Jack captain of the Black Pearl for 13 years in exchange for 100 years of service aboard Jones' ship, the Flying Dutchman. Sparrow's debt is complicated by both Will Turner and Elizabeth Swann, who follow him out to sea.","image":"0002.jpg"},{"index":"0003","genrese":"Adventure","name":"Pirates of the Caribbean 3","directed":"Gore Verbinski","runtime":"168","year":"2007","language":"English","moreinformation":"Lord Beckett gains power over Davy Jones and, with the help of the Flying Dutchman, he is now executing his plans to extinguish piracy forever. To stand against the East India Trading Co., Will, Elizabeth, Barbossa, and the crew of the Black Pearl set out to rescue Captain Jack Sparrow from Davy Jones' Locker. As one of the Nine Pirate Lords, Jack is needed in order to release an ancient goddess with the power to defeat Beckett's forces.","image":"0003.jpg"},{"index":"0004","genrese":"Adventure","name":"Pirates of the Caribbean: On Stranger Tides","directed":"Rob Marshall","runtime":"137","year":"2011","language":"English","moreinformation":"Captain Jack Sparrow is on a quest to find the fabled Fountain of Youth and crosses paths with a former lover, Angelica. She forces Jack aboard the Queen Anne's Revenge, a ship captained by the infamous pirate Blackbeard, Angelica's father. Both are also in search of the Fountain: Angelica to save her father's soul, Blackbeard to escape a prophecy of his demise at the hands of a one-legged man. Joining the hunt is former pirate captain Barbossa, now a privateer in King George II's Navy, who is in a race against the Spanish for the Fountain of Youth.","image":"0004.jpg"},{"index":"0005","genrese":"Adventure","name":"Pirates of the Caribbean: Dead Men Tell No Tales","directed":"Joachim Rønning","runtime":"129","year":"2017","language":"English","moreinformation":"A group of ghostly Spanish Royal Navy soldiers led by Jack Sparrow's old nemesis, Captain Armando Salazar, escape from the Devil's Triangle, with the goal of killing every pirate at sea, including Sparrow. To survive, Sparrow seeks out the legendary Trident of Poseidon, a powerful artifact whose owner can control the seas, tides, aquatic animals and break curses.","image":"0005.jpg"},{"index":"0006","genrese":"Romance","name":"The Silver Skates","directed":"Michael Lockshin","runtime":"136","year":"2021","language":"Russia","moreinformation":"The Silver Skates is a 2020 Russian period epic romantic adventure film directed by Michael Lockshin in his feature directorial debut, with a screenplay written by Roman Kantor, and produced by Petr Anurov. The film was initially inspired by Romeo and Juliet, and is based on the American novel Hans Brinker, or The Silver Skates by Mary Mapes Dodge. The story is set in Saint Petersburg, capital of the Russian Empire, during the winter of 1899 in the late 19th - early 20th centuries. The city's ice-covered rivers and canals act as broad avenues, traversed on ice-skates and sleds, with markets and winter festivals on the ice. Social classes mix in this winter wonderland, and the courier Matvey crosses paths with the aristocrat Alisa is an intellectual girl, close to a noble family. The film stars Fedor Fedotov and Sofya Priss,[5] alongside Kirill Zaytsev, Yuri Borisov, Aleksei Guskov, Severija Janusauskaite, Yuri Kolokolnikov, Timofey Tribuntsev, and Aleksandra Revenko in supporting roles. Principal photography lasted from January to May 2019, the shots taking place in the cities of Saint Petersburg and the Leningrad Oblast.","image":"0006.jpg"},{"index":"0007","genrese":"Musical/Dance","name":"Pitch Perfect 3","directed":"Trish Sie","runtime":"93","year":"2017","language":"English","moreinformation":"Pitch Perfect 3 is a 2017 American musical comedy film directed by Trish Sie and written by Kay Cannon and Mike White. A sequel to Pitch Perfect 2 (2015) and the third and final installment in the Pitch Perfect trilogy, the film stars Anna Kendrick, Anna Camp, Rebel Wilson, Brittany Snow, Hailee Steinfeld, Hana Mae Lee, Ester Dean, Chrissie Fit, Alexis Knapp, John Lithgow, Matt Lanter, Ruby Rose, Kelley Jakle, Shelley Regner, John Michael Higgins, and Elizabeth Banks. The film follows the Bellas, now graduated from college, reuniting for one final performance together during an overseas USO tour.","image":"0007.jpg"},{"index":"0008","genrese":"Action","name":"The Rhythm Section","directed":"Reed Morano","runtime":"109","year":"2020","language":"English","moreinformation":"Stephanie Patrick veers down a path of self-destruction after a tragic plane crash kills her family. When Stephanie discovers it wasn't an accident, she turns to a former CIA operative who can help her find the culprits. But her quest to uncover the truth soon turns into a full-blown quest for revenge as Patrick decides to punish those responsible.","image":"0008.jpg"},{"index":"0009","genrese":"Drama","name":"The Call of the Wild","directed":"Christopher Sanders","runtime":"100","year":"2020","language":"English","moreinformation":"Buck is a big-hearted dog whose blissful domestic life gets turned upside down when he is suddenly uprooted from his California home and transplanted to the exotic wilds of the Alaskan Yukon in the 1890s. As the newest rookie on a mail-delivery dog sled team, Buck experiences the adventure of a lifetime as he ultimately finds his true place in the world.","image":"https://jenting-wu.github.io/about/My-movie-theater"},{"index":"0010","genrese":"Horror","name":"Fantasy Island","directed":"Jeff Wadlow","runtime":"109","year":"2020","language":"English","moreinformation":"The enigmatic Mr. Roarke makes the secret dreams of his guests come true at a luxurious tropical resort. But when the fantasies turn into nightmares, the visitors must soon solve the island's mystery in order to escape with their lives.","image":"0010.jpg"},{"index":"0011","genrese":"Horror","name":"The Invisible Man","directed":"Leigh Whannell","runtime":"124","year":"2020","language":"English","moreinformation":"After staging his own suicide, a crazed scientist uses his power to become invisible to stalk and terrorize his ex-girlfriend. When the police refuse to believe her story, she decides to take matters into her own hands and fight back.","image":"0011.png"},{"index":"0012","genrese":"Drama","name":"The Photograph","directed":"Stella Meghie","runtime":"106","year":"2020","language":"English","moreinformation":"When famed photographer Christina Eames dies unexpectedly, she leaves her estranged daughter, Mae, hurt, angry and full of questions. When Mae finds a photograph tucked away in a safe-deposit box, she soon finds herself delving into her mother's early life -- an investigation that leads to an unexpected romance with a rising journalist.","image":"0012.png"},{"index":"0013","genrese":"Science Fiction","name":"Tenet","directed":"Christopher Nolan","runtime":"150","year":"2020","language":"English","moreinformation":"A secret agent embarks on a dangerous, time-bending mission to prevent the start of World War III.","image":"0013.jpg"},{"index":"0014","genrese":"Adventure","name":"Mulan","directed":"Niki Caro","runtime":"116","year":"2020","language":"English","moreinformation":"To save her ailing father from serving in the Imperial Army, a fearless young woman disguises herself as a man to battle northern invaders in China.","image":"0014.png"},{"index":"0015","genrese":"Comedy","name":"Promising Young Woman","directed":"Emerald Fennell","runtime":"113","year":"2020","language":"English","moreinformation":"Nothing in Cassie's life is what it appears to be -- she's wickedly smart, tantalizingly cunning, and she's living a secret double life by night. Now, an unexpected encounter is about to give Cassie a chance to right the wrongs from the past.","image":"0015.png"},{"index":"0016","genrese":"Comedy","name":"The Witches","directed":"Robert Zemeckis","runtime":"105","year":"2020","language":"English","moreinformation":"In late 1967, a young orphaned boy goes to live with his loving grandma in the rural Alabama town of Demopolis. As the boy and his grandmother encounter some deceptively glamorous but thoroughly diabolical witches, she wisely whisks him away to a seaside resort. Regrettably, they arrive at precisely the same time that the world's Grand High Witch has gathered her fellow cronies from around the globe -- under cover -- to carry out her nefarious plans.","image":"0016.JFIF"},{"index":"0017","genrese":"Drama","name":"Parasite","directed":"Bong Joon-ho","runtime":"132","year":"2019","language":"Korean","moreinformation":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.","image":"0017.jpg"},{"index":"0018","genrese":"Drama","name":"Ash Is Purest White","directed":"ZhangKe Jia","runtime":"141","year":"2019","language":"Chinese","moreinformation":"In an industrial city in China, a young dancer named Qiao falls in love with a mobster named Bin. When a fight breaks out between rival gangs, Qiao uses a gun to protect Bin and is sent to prison for five years.","image":"0018-1.JFIF"},{"index":"0019","genrese":"Action","name":"Mission: Impossible - Fallout","directed":"Christopher McQuarrie","runtime":"147","year":"2018","language":"English","moreinformation":"Ethan Hunt and the IMF team join forces with CIA assassin August Walker to prevent a disaster of epic proportions. Arms dealer John Lark and a group of terrorists known as the Apostles plan to use three plutonium cores for a simultaneous nuclear attack on the Vatican, Jerusalem and Mecca, Saudi Arabia. When the weapons go missing, Ethan and his crew find themselves in a desperate race against time to prevent them from falling into the wrong hands.","image":"0019.JPEG"},{"index":"0020","genrese":"Adventure","name":"Jurassic World","directed":"Colin Trevorrow","runtime":"124","year":"2015","language":"English","moreinformation":"Located off the coast of Costa Rica, the Jurassic World luxury resort provides a habitat for an array of genetically engineered dinosaurs, including the vicious and intelligent Indominus rex. When the massive creature escapes, it sets off a chain reaction that causes the other dinos to run amok. Now, it's up to a former military man and animal expert (Chris Pratt) to use his special skills to save two young brothers and the rest of the tourists from an all-out, prehistoric assault.","image":"0020.jpg"},{"index":"0021","type":"Movie","genrese":"Drama","name":"Lady Bird","directed":"Greta Gerwig","runtime":"94","year":"2017","language":"English","moreinformation":"A teenager (Saoirse Ronan) navigates a loving but turbulent relationship with her strong-willed mother (Laurie Metcalf) over the course of an eventful and poignant senior year of high school.","image":"0021.jpg"},{"index":"0022","type":"Series","genrese":"Drama","name":"How to Get Away with Murder","directed":"Peter Nowalk","season":"6","episodes":"15","runtime":"43","year":"2014","language":"English","moreinformation":"How to Get Away with Murder is an American legal thriller television series that premiered on ABC on September 25, 2014, and concluded on May 14, 2020. The series was created by Peter Nowalk, and produced by Shonda Rhimes and ABC Studios. The series aired on ABC as part of a night of programming, all under Rhimes's Shondaland production company.","image":"0022.jpg"}]